cube-permutations-1.org
#+title: Playing With a Rubik's Cube by Permutations
#+OPTIONS: num:nil ':t
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="org-overrides.css" />
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="cube-styles.css" />
#+HTML_HEAD_EXTRA: <script type="text/javascript" src="rubiks-cube-manipulations.js"></script>

* Playing with a Rubik's Cube is just playing with permutations?

I have to confess that I never really had a good mental model for how
to solve a Rubik's Cube.  I am able to manipulate one into a solved
position, but only because I practiced the moves listed in [[https://smile.amazon.com/Winning-Ways-Your-Mathematical-Plays/dp/1568811446][Winning
Ways for Your Mathematical Plays, Volume 4]].  

To that end, I have tried to figure out just how I would find my own
algorithm.  Best approach I ever came up with was what I suspect I was
just too lazy for before, just put in the hard work of outlining the
moves I know and looking for patterns.

Luckily, I have a computer to help with this now.  Should be able to
write a program that can search through the possible combinations
easily enough.

The question that comes to mind, however, is just how to encode the
moves and the state of the board.  I could model the cube where I keep
track of each piece and how it is currently configured.  However, that
feels like it is more effort than I would care for.  

Instead, I think if you treated each "face" of the cube as a number,
then the current state is just a permutation of the numbers; with each
manipulation just an application of another permutation.

(Quick warning that I don't actually get to solving the puzzle in this
post.  Just playing with the representation and some html/css.)


