cube-permutations-1.org
* First, let us see if the idea works

While I was rather confident that this would work, still felt good to
validate it.

There is a chance I will try and learn how to do 3d projections in
css.  Most likely, though, I am just going to go with a projection of
a cube to look at.  If you are reading this and it is still a 2d
"unfolding" of a cube... you know what I did.

Note that I will always look at the html corresponding to the numeric
sequence $1,2,3,\ldots,54$.  Whenever we apply a permutation change to
the sequence, we will simply swap the colors.  You can confirm that
this is equivalent to changing the numbers easily enough.

Our html for this sequence, then, is a simple set of divs for each
number.  We go ahead and add a class for the color of the solved cube.

#+BEGIN_SRC html 
  <div class="cube">
    <div class="face face1  orange ">1</div>
    <div class="face face2  orange ">2</div>
    <div class="face face3  orange ">3</div>
    <div class="face face4  orange ">4</div>
    <div class="face face5  orange ">5</div>
    <div class="face face6  orange ">6</div>
    <div class="face face7  orange ">7</div>
    <div class="face face8  orange ">8</div>
    <div class="face face9  orange ">9</div>
    <div class="face face10 yellow ">10</div>
    <div class="face face11 yellow ">11</div>
    <div class="face face12 yellow ">12</div>
    <div class="face face13 yellow ">13</div>
    <div class="face face14 yellow ">14</div>
    <div class="face face15 yellow ">15</div>
    <div class="face face16 yellow ">16</div>
    <div class="face face17 yellow ">17</div>
    <div class="face face18 yellow ">18</div>
    <div class="face face19 green  ">19</div>
    <div class="face face20 green  ">20</div>
    <div class="face face21 green  ">21</div>
    <div class="face face22 green  ">22</div>
    <div class="face face23 green  ">23</div>
    <div class="face face24 green  ">24</div>
    <div class="face face25 green  ">25</div>
    <div class="face face26 green  ">26</div>
    <div class="face face27 green  ">27</div>
    <div class="face face28 red    ">28</div>
    <div class="face face29 red    ">29</div>
    <div class="face face30 red    ">30</div>
    <div class="face face31 red    ">31</div>
    <div class="face face32 red    ">32</div>
    <div class="face face33 red    ">33</div>
    <div class="face face34 red    ">34</div>
    <div class="face face35 red    ">35</div>
    <div class="face face36 red    ">36</div>
    <div class="face face37 blue   ">37</div>
    <div class="face face38 blue   ">38</div>
    <div class="face face39 blue   ">39</div>
    <div class="face face40 blue   ">40</div>
    <div class="face face41 blue   ">41</div>
    <div class="face face42 blue   ">42</div>
    <div class="face face43 blue   ">43</div>
    <div class="face face44 blue   ">44</div>
    <div class="face face45 blue   ">45</div>
    <div class="face face46 white  ">46</div>
    <div class="face face47 white  ">47</div>
    <div class="face face48 white  ">48</div>
    <div class="face face49 white  ">49</div>
    <div class="face face50 white  ">50</div>
    <div class="face face51 white  ">51</div>
    <div class="face face52 white  ">52</div>
    <div class="face face53 white  ">53</div>
    <div class="face face54 white  ">54</div>
  </div>
#+END_SRC

Styled with some no frills css: 

#+BEGIN_SRC css :tangle cube-styles.css  :comments link
    .cube {
        margin: auto;
        margin-bottom: 2em;
        position: relative;
        width: 384px;
        height: 288px;
    }

    .cube .face {
        position: absolute;
        box-sizing: border-box;
        padding: 0;
        margin: 0;
        width: 32px;
        height: 32px;
        border: solid 1px black;
        line-height: 32px;
        text-align: center;
    }

    .cube .face1  { top: 96px;  left: 0px;   }
    .cube .face2  { top: 96px;  left: 32px;  }
    .cube .face3  { top: 96px;  left: 64px;  }
    .cube .face4  { top: 128px; left: 0px;   }
    .cube .face5  { top: 128px; left: 32px;  }
    .cube .face6  { top: 128px; left: 64px;  }
    .cube .face7  { top: 160px; left: 0px;   }
    .cube .face8  { top: 160px; left: 32px;  }
    .cube .face9  { top: 160px; left: 64px;  }
    .cube .face10 { top: 96px;  left: 96px;  }
    .cube .face11 { top: 96px;  left: 128px; }
    .cube .face12 { top: 96px;  left: 160px; }
    .cube .face13 { top: 128px; left: 96px;  }
    .cube .face14 { top: 128px; left: 128px; }
    .cube .face15 { top: 128px; left: 160px; }
    .cube .face16 { top: 160px; left: 96px;  }
    .cube .face17 { top: 160px; left: 128px; }
    .cube .face18 { top: 160px; left: 160px; }
    .cube .face19 { top: 96px;  left: 192px; }
    .cube .face20 { top: 96px;  left: 224px; }
    .cube .face21 { top: 96px;  left: 256px; }
    .cube .face22 { top: 128px; left: 192px; }
    .cube .face23 { top: 128px; left: 224px; }
    .cube .face24 { top: 128px; left: 256px; }
    .cube .face25 { top: 160px; left: 192px; }
    .cube .face26 { top: 160px; left: 224px; }
    .cube .face27 { top: 160px; left: 256px; }
    .cube .face28 { top: 96px;  left: 288px; }
    .cube .face29 { top: 96px;  left: 320px; }
    .cube .face30 { top: 96px;  left: 352px; }
    .cube .face31 { top: 128px; left: 288px; }
    .cube .face32 { top: 128px; left: 320px; }
    .cube .face33 { top: 128px; left: 352px; }
    .cube .face34 { top: 160px; left: 288px; }
    .cube .face35 { top: 160px; left: 320px; }
    .cube .face36 { top: 160px; left: 352px; }
    .cube .face37 { top: 0px;   left: 96px;  }
    .cube .face38 { top: 0px;   left: 128px; }
    .cube .face39 { top: 0px;   left: 160px; }
    .cube .face40 { top: 32px;  left: 96px;  }
    .cube .face41 { top: 32px;  left: 128px; }
    .cube .face42 { top: 32px;  left: 160px; }
    .cube .face43 { top: 64px;  left: 96px;  }
    .cube .face44 { top: 64px;  left: 128px; }
    .cube .face45 { top: 64px;  left: 160px; }
    .cube .face46 { top: 192px; left: 96px;  }
    .cube .face47 { top: 192px; left: 128px; }
    .cube .face48 { top: 192px; left: 160px; }
    .cube .face49 { top: 224px; left: 96px;  }
    .cube .face50 { top: 224px; left: 128px; }
    .cube .face51 { top: 224px; left: 160px; }
    .cube .face52 { top: 256px; left: 96px;  }
    .cube .face53 { top: 256px; left: 128px; }
    .cube .face54 { top: 256px; left: 160px; }

    .cube .orange { background-color: orange; }
    .cube .green  { background-color: green;  }
    .cube .white  { background-color: white;  }
    .cube .yellow { background-color: yellow; }
    .cube .red    { background-color: red;    }
    .cube .blue   { background-color: blue;   }
#+END_SRC

And we get:

#+BEGIN_HTML
  <div class="cube">
    <div class="face face1  orange ">1</div>
    <div class="face face2  orange ">2</div>
    <div class="face face3  orange ">3</div>
    <div class="face face4  orange ">4</div>
    <div class="face face5  orange ">5</div>
    <div class="face face6  orange ">6</div>
    <div class="face face7  orange ">7</div>
    <div class="face face8  orange ">8</div>
    <div class="face face9  orange ">9</div>
    <div class="face face10 yellow ">10</div>
    <div class="face face11 yellow ">11</div>
    <div class="face face12 yellow ">12</div>
    <div class="face face13 yellow ">13</div>
    <div class="face face14 yellow ">14</div>
    <div class="face face15 yellow ">15</div>
    <div class="face face16 yellow ">16</div>
    <div class="face face17 yellow ">17</div>
    <div class="face face18 yellow ">18</div>
    <div class="face face19 green  ">19</div>
    <div class="face face20 green  ">20</div>
    <div class="face face21 green  ">21</div>
    <div class="face face22 green  ">22</div>
    <div class="face face23 green  ">23</div>
    <div class="face face24 green  ">24</div>
    <div class="face face25 green  ">25</div>
    <div class="face face26 green  ">26</div>
    <div class="face face27 green  ">27</div>
    <div class="face face28 red    ">28</div>
    <div class="face face29 red    ">29</div>
    <div class="face face30 red    ">30</div>
    <div class="face face31 red    ">31</div>
    <div class="face face32 red    ">32</div>
    <div class="face face33 red    ">33</div>
    <div class="face face34 red    ">34</div>
    <div class="face face35 red    ">35</div>
    <div class="face face36 red    ">36</div>
    <div class="face face37 blue   ">37</div>
    <div class="face face38 blue   ">38</div>
    <div class="face face39 blue   ">39</div>
    <div class="face face40 blue   ">40</div>
    <div class="face face41 blue   ">41</div>
    <div class="face face42 blue   ">42</div>
    <div class="face face43 blue   ">43</div>
    <div class="face face44 blue   ">44</div>
    <div class="face face45 blue   ">45</div>
    <div class="face face46 white  ">46</div>
    <div class="face face47 white  ">47</div>
    <div class="face face48 white  ">48</div>
    <div class="face face49 white  ">49</div>
    <div class="face face50 white  ">50</div>
    <div class="face face51 white  ">51</div>
    <div class="face face52 white  ">52</div>
    <div class="face face53 white  ">53</div>
    <div class="face face54 white  ">54</div>
  </div>
#+END_HTML

First, yes, these both would be trivial using loops.  Not really the
point of what I'm looking for right now, though; so moving on.

Note that I went ahead and displayed the number of each face.  This
was primarily to help me come up with the moves below.

What I am claiming is that I could represent one of the standard moves
of a cube as a simple permutation.  More, composing the permutations
in a standard way where $AB$ means applying $A$ then $B$, and that
this gives us the resulting state of the cube after applying the two
moves/permutations.

Under the syntax where $(1\ 2\ 3)$ means moving $1 \rightarrow 2, 2
\rightarrow 3, 3 \rightarrow 1$, read as 1 moves to 2 moves to 3 moves
to 1, we would have the rotation of the right face as $R' = (12\ 48\
34\ 39)(15\ 51\ 31\ 42)(18\ 54\ 28\ 45)(19\ 25\ 27\ 21)(20\ 22\ 26\
24)$.  (Why $R'$?  Because I mistakenly did that instead of $R$.)

Not so quickly applying $R'$ to the initial board by hand, we get:

#+BEGIN_HTML
  <div class="cube">
    <div class="face face1  orange ">1</div>
    <div class="face face2  orange ">2</div>
    <div class="face face3  orange ">3</div>
    <div class="face face4  orange ">4</div>
    <div class="face face5  orange ">5</div>
    <div class="face face6  orange ">6</div>
    <div class="face face7  orange ">7</div>
    <div class="face face8  orange ">8</div>
    <div class="face face9  orange ">9</div>
    <div class="face face10 yellow ">10</div>
    <div class="face face11 yellow ">11</div>
    <div class="face face12 blue   ">12</div>
    <div class="face face13 yellow ">13</div>
    <div class="face face14 yellow ">14</div>
    <div class="face face15 blue   ">15</div>
    <div class="face face16 yellow ">16</div>
    <div class="face face17 yellow ">17</div>
    <div class="face face18 blue   ">18</div>
    <div class="face face19 green  ">19</div>
    <div class="face face20 green  ">20</div>
    <div class="face face21 green  ">21</div>
    <div class="face face22 green  ">22</div>
    <div class="face face23 green  ">23</div>
    <div class="face face24 green  ">24</div>
    <div class="face face25 green  ">25</div>
    <div class="face face26 green  ">26</div>
    <div class="face face27 green  ">27</div>
    <div class="face face28 white  ">28</div>
    <div class="face face29 red    ">29</div>
    <div class="face face30 red    ">30</div>
    <div class="face face31 white  ">31</div>
    <div class="face face32 red    ">32</div>
    <div class="face face33 red    ">33</div>
    <div class="face face34 white  ">34</div>
    <div class="face face35 red    ">35</div>
    <div class="face face36 red    ">36</div>
    <div class="face face37 blue   ">37</div>
    <div class="face face38 blue   ">38</div>
    <div class="face face39 red    ">39</div>
    <div class="face face40 blue   ">40</div>
    <div class="face face41 blue   ">41</div>
    <div class="face face42 red    ">42</div>
    <div class="face face43 blue   ">43</div>
    <div class="face face44 blue   ">44</div>
    <div class="face face45 red    ">45</div>
    <div class="face face46 white  ">46</div>
    <div class="face face47 white  ">47</div>
    <div class="face face48 yellow ">48</div>
    <div class="face face49 white  ">49</div>
    <div class="face face50 white  ">50</div>
    <div class="face face51 yellow ">51</div>
    <div class="face face52 white  ">52</div>
    <div class="face face53 white  ">53</div>
    <div class="face face54 yellow ">54</div>
  </div>
#+END_HTML

So, comfortingly, this confirms that the permutation at least leaves
the board as we desired.  However, this is just a single permutation.
Does applying it twice do as expected?  Specificaly, does $R'^2 = (12\
34)(48\ 39)(15\ 31)(42\ 51)(18\ 28)(45\ 54)(19\ 27)(21\ 25)(20\
26)(22\ 24)$?

I am actually not going to redraw it with the colors swapped as
indicated, leaving that for any intrepid reader that comes along.
Instead, I will note that we can happily and easily see that $R^4 =
R'^{2^2} = ()$, which is as expected.  Similarly, if $R'^{-1}$ takes the
expected shape, we can see that $R'^nR'^{-n} = ()$, which is again as
expected.


