cube-permutations-1.org
* Automating more of this.

Armed with the belief that this works, we can now move on to
automating more of this.  Since, though it is in some ways easier to
write these permutations than to manipulate a real cube, there are
still many more permutations than I could possibly write down.

The goals for this blog are methods that can let me manipulate a set
of divs similar to above with some simple buttons.  Later, I hope to
take this in a direction where I can automate the search for moves,
but for now, I just want something to play with.

To start, lets take something that will insert all of the divs we
need.  We'll try and reuse the same styling I used above.  Mainly for
sunken costs reasons.  Which is to say, this might not be an idea
worth holding onto.

#+BEGIN_SRC javascript :tangle rubiks-cube-manipulations.js  :comments link
  function createCubeDiv() {
      var cube = withAttribute(div(),
                               "class",
                               "cube");
      var colors = ["orange",
                    "blue",
                    "green",
                    "red",
                    "yellow",
                    "white"]
     for (var i = 0; i < 54; i++) {
          cube.appendChild(withAttribute(div(withAttribute(div(),
                                                           "class",
                                                           colors[Math.floor(i / 9)])),
                                         "class",
                                         "face face" + (i + 1)));
                                         
      }
      return cube;
  }
#+END_SRC

We are using a new div for the color for the reason that it makes our
manipulation of the cube easier.  Specifically, we won't have to worry
about extracting any information from the elements (or storing them
elsewhere) and can instead just use a standard selector to get an
element and set it to the new value we want it to have.  Because of
that, though, we need to add a few extra styles to make sure this
works.

We'll also go ahead and add a transition property so that when we move
the cubes, you can see them moving.

#+BEGIN_SRC css :tangle cube-styles.css  :comments link
  .cube * {
      transition: 2s;
  }

  .face .orange, .face .red,    .face .green,
  .face .blue,   .face .yellow, .face .white {
      width: 100%;
      height: 100%;
  }
#+END_SRC

Of course, for this to work, we need the functions "withAttribute" and
"div".  I suspect these could be replaced with framework methods from
basically any framework.

#+BEGIN_SRC javascript :tangle rubiks-cube-manipulations.js  :comments link
  function div(child) {
      var element = document.createElement("div");
      if (child) {
          element.appendChild(child);
      }
      return element;
  }

  function withAttribute(element, name, value) {
      element.setAttribute(name, value);
      return element;
  }
#+END_SRC

That will get me the divs that we were playing with in the first
section.  Now we want a function that we can use to pick where I place
this.  Going with something that will just append the cube to all
results of a css selector.

#+BEGIN_SRC javascript :tangle rubiks-cube-manipulations.js  :comments link
  function appendCubeToCssSelector(selector) {
      Array.from(document.querySelectorAll(selector)).forEach(function(node) {
          node.appendChild(createCubeDiv());
      });
  }
#+END_SRC


Now that we have methods that can create and place a cube, lets create
some methods that can move the faces around for us.  We'll start with
defining the moves.  Our datastructure for this is a simple array of
numbers, indicating where a given piece should go.  For those that
don't move, they should indicate their current index.

I did make things a little awkward by using 1 based indexes for the
styles.  I'm currently planning on just living with that awkwardness.

I am also using the names of the moves from [[https://smile.amazon.com/Winning-Ways-Your-Mathematical-Plays/dp/1568811446][Winning Ways]].  (At least,
that is the intent.)

#+BEGIN_SRC javascript :tangle rubiks-cube-manipulations.js :comments link
  var CubeMoves = {
      "R" : [ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10,
              11, 39, 13, 14, 42, 16, 17, 45, 21, 24,
              27, 20, 23, 26, 19, 22, 25, 54, 29, 30,
              51, 32, 33, 48, 35, 36, 37, 38, 34, 40,
              41, 31, 43, 44, 28, 46, 47, 12, 49, 50,
              15, 52, 53, 18 ],
      "R'" : [ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10,
               11, 48, 13, 14, 51, 16, 17, 54, 25, 22,
               19, 26, 23, 20, 27, 24, 21, 45, 29, 30,
               42, 32, 33, 39, 35, 36, 37, 38, 12, 40,
               41, 15, 43, 44, 18, 46, 47, 34, 49, 50,
               31, 52, 53, 28 ],
      "L" : [ 3,  6,  9,  2,  5,  8,  1,  4,  7, 46,
              11, 12, 49, 14, 15, 52, 17, 18, 19, 20,
              21, 22, 23, 24, 25, 26, 27, 28, 29, 43,
              31, 32, 40, 34, 35, 37, 10, 38, 39, 13,
              41, 42, 16, 44, 45, 36, 47, 48, 33, 50,
              51, 30, 53, 54 ],
      "L'" : [ 7,  4,  1,  8,  5,  2,  9,  6,  3, 37,
               11, 12, 40, 14, 15, 43, 17, 18, 19, 20,
               21, 22, 23, 24, 25, 26, 27, 28, 29, 52,
               31, 32, 49, 34, 35, 46, 36, 38, 39, 33,
               41, 42, 30, 44, 45, 10, 47, 48, 13, 50,
               51, 16, 53, 54 ],
      "U" : [ 28, 29, 30,  4,  5,  6,  7,  8,  9, 1,
              2, 3, 13, 14, 15, 16, 17, 18, 10, 11,
              12, 22, 23, 24, 25, 26, 27, 19, 20, 21,
              31, 32, 33, 34, 35, 36, 39, 42, 45, 38,
              41, 44, 37, 40, 43, 46, 47, 48, 49, 50,
              51, 52, 53, 54 ],
      "U'" : [ 10, 11, 12,  4,  5,  6,  7,  8,  9, 19,
               20, 21, 13, 14, 15, 16, 17, 18, 28, 29,
               30, 22, 23, 24, 25, 26, 27, 1, 2, 3,
               31, 32, 33, 34, 35, 36, 43, 40, 37, 44,
               41, 38, 45, 42, 39, 46, 47, 48, 49, 50,
               51, 52, 53, 54 ],
      "D" : [ 1,  2,  3,  4,  5,  6,  16, 17, 18, 10,
              11, 12, 13, 14, 15, 25, 26, 27, 19, 20,
              21, 22, 23, 24, 34, 35, 36, 28, 29, 30,
              31, 32, 33, 7, 8, 9, 37, 38, 39, 40,
              41, 42, 43, 44, 45, 48, 51, 54, 47, 50,
              53, 46, 49, 52 ],
      "D'" : [ 1,  2,  3,  4,  5,  6,  34, 35, 36, 10,
               11, 12, 13, 14, 15, 7, 8, 9, 19, 20,
               21, 22, 23, 24, 16, 17, 18, 28, 29, 30,
               31, 32, 33, 25, 26, 27, 37, 38, 39, 40,
               41, 42, 43, 44, 45, 52, 49, 46, 53, 50,
               47, 54, 51, 48 ],
      "F" : [ 1,  2,  45,  4,  5, 44,  7,  8, 43, 12,
              15, 18, 11, 14, 17, 10, 13, 16, 48, 20,
              21, 47, 23, 24, 46, 26, 27, 28, 29, 30,
              31, 32, 33, 34, 35, 36, 37, 38, 39, 40,
              41, 42, 19, 22, 25, 3, 6, 9, 49, 50,
              51, 52, 53, 54 ],
      "F'" : [ 1,  2,  46,  4,  5, 47,  7,  8, 48, 16,
               13, 10, 17, 14, 11, 18, 15, 12, 43, 20,
               21, 44, 23, 24, 45, 26, 27, 28, 29, 30,
               31, 32, 33, 34, 35, 36, 37, 38, 39, 40,
               41, 42, 9, 6, 3, 25, 22, 19, 49, 50,
               51, 52, 53, 54 ],
      "B" : [ 52,  2,  3,  53,  5,  6,  54,  8,  9, 10,
              11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
              37, 22, 23, 38, 25, 26, 39, 30, 33, 36,
              29, 32, 35, 28, 31, 34, 7, 4, 1, 40,
              41, 42, 43, 44, 45, 46, 47, 48, 49, 50,
              51, 27, 24, 21 ],
      "B'" : [ 39,  2,  3,  38,  5,  6,  37,  8,  9, 10,
               11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
               54, 22, 23, 53, 25, 26, 52, 34, 31, 28,
               35, 32, 29, 36, 33, 30, 21, 24, 27, 40,
               41, 42, 43, 44, 45, 46, 47, 48, 49, 50,
               51, 1, 4, 7 ],
      "α" : [ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10,
              38, 12, 13, 41, 15, 16, 44, 18, 19, 20,
              21, 22, 23, 24, 25, 26, 27, 28, 53, 30,
              31, 50, 33, 34, 47, 36, 37, 35, 39, 40,
              32, 42, 43, 29, 45, 46, 11, 48, 49, 14,
              51, 52, 17, 54 ],
      "β" : [ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10,
              47, 12, 13, 50, 15, 16, 53, 18, 19, 20,
              21, 22, 23, 24, 25, 26, 27, 28, 44, 30,
              31, 41, 33, 34, 38, 36, 37, 11, 39, 40,
              14, 42, 43, 17, 45, 46, 35, 48, 49, 32,
              51, 52, 29, 54 ],
      "γ" : [ 1,  49,  3,  4,  50,  6,  7,  51,  9, 10,
              11, 12, 13, 14, 15, 16, 17, 18, 19, 40,
              21, 22, 41, 24, 25, 42, 27, 28, 29, 30,
              31, 32, 33, 34, 35, 36, 37, 38, 39, 8,
              5, 2, 43, 44, 45, 46, 47, 48, 26, 23,
              20, 52, 53, 54 ],
      "δ" : [ 1,  42,  3,  4,  41,  6,  7,  40,  9, 10,
              11, 12, 13, 14, 15, 16, 17, 18, 19, 51,
              21, 22, 50, 24, 25, 49, 27, 28, 29, 30,
              31, 32, 33, 34, 35, 36, 37, 38, 39, 20,
              23, 26, 43, 44, 45, 46, 47, 48, 2, 5,
              8, 52, 53, 54 ],
      "ε" : [ 1,  2,  3,  13,  14,  15,  7,  8,  9, 10,
              11, 12, 22, 23, 24, 16, 17, 18, 19, 20,
              21, 31, 32, 33, 25, 26, 27, 28, 29, 30,
              4, 5, 6, 34, 35, 36, 37, 38, 39, 40,
              41, 42, 43, 44, 45, 46, 47, 48, 49, 50,
              51, 52, 53, 54 ],
      "ω" : [ 1,  2,  3,  31,  32,  33,  7,  8,  9, 10,
              11, 12, 4, 5, 6, 16, 17, 18, 19, 20,
              21, 13, 14, 15, 25, 26, 27, 28, 29, 30,
              22, 23, 24, 34, 35, 36, 37, 38, 39, 40,
              41, 42, 43, 44, 45, 46, 47, 48, 49, 50,
              51, 52, 53, 54 ]
  };
#+END_SRC

With the moves defined, we just need a function to apply a named move
to a cube.  Doing this in two passes, since I don't feel like writing
a more "efficient" one pass algorithm, and can't imagine this will be
a bottleneck for me.

#+BEGIN_SRC javascript :tangle rubiks-cube-manipulations.js :comments link
    function applyCubeMove(cube, moveName) {
        if (!CubeMoves[moveName]) {
            throw "Unknown move '" + moveName + "'";
        }
        if (!cube) {
            throw "Need the cube that we will be modifying."
        }
        var movesToMake = [];
        CubeMoves[moveName].forEach(function (item, index) {
            if (item != (index + 1)) {
                movesToMake.push({
                    "div" : cube.querySelector(".face"+(index+1)),
                    "target" : item
                });
            }
        });
        movesToMake.forEach(function(item) {
            item.div.setAttribute("class", "face face"+item.target);
        });
    }
#+END_SRC

Of course, having to drop to the console all of the time, finding the
selector for a cube, and running the appropriate script would get
somewhat old.  To that end, lets go ahead and build a "move list" that
will go with a cube.  Going ahead and building the helper methods in
this section.

#+BEGIN_SRC javascript :tangle rubiks-cube-manipulations.js :comments link
  function appendMoveListToCssSelector(selector) {
      Array.from(document.querySelectorAll(selector)).forEach(function(node) {
          var moveListDiv = withAttribute(div(text("Move List:")),
                                          "class",
                                          "move-list");
          node.appendChild(moveListDiv)
          for (var move in CubeMoves) {
              moveListDiv.appendChild(withOnClick(function(move) {
                  return function() {
                      applyCubeMove(node, move);
                  };
              }(move), button(text(move))));
          }
      });
  }

  function button(child) {
      var element = document.createElement("button");
      if (child) {
          element.appendChild(child);
      }
      return element;
  }

  function text(text) {
      return document.createTextNode(text);
  }

  function withOnClick(f, element) {
      element.onclick = f;
      return element;
  }
#+END_SRC

We're just going for not terribly ugly.  Fancy may happen at a later
date.

#+BEGIN_SRC css :tangle cube-styles.css :comments link
  .move-list {
      float: left;
      border: solid thin black;
      background-color: white;
      width: 100px;
      text-align: center;
  }

  .move-list button {
      display: inline-block;
      width: 45px;
      margin: auto;
  } 
#+END_SRC

With all of that done, lets wire it up and see what we can play with.

#+BEGIN_HTML
<div class="playground"></div>
<script>
appendMoveListToCssSelector(".playground");
appendCubeToCssSelector(".playground");
</script>
#+END_HTML

