cube-styles.css

.face .orange, .face .red,    .face .green,
.face .blue,   .face .yellow, .face .white {
    width: 100%;
    height: 100%;
}

/* Automating\ more\ of\ this\.:1 ends here */

/* [[file:~/projects/taeric.github.io/cube-permutations-1.org::*Automating%20more%20of%20this.][Automating\ more\ of\ this\.:1]] */

.move-list {
    float: left;
    border: solid thin black;
    background-color: white;
    width: 100px;
    text-align: center;
}

.move-list button {
    display: inline-block;
    width: 45px;
    margin: auto;
}

/* Automating\ more\ of\ this\.:1 ends here */
